%%% Ag의 n, k값 구하는 함수 %%%


% 작성자 : 박정현
% 작성일 : 2008.9.16
% 참고논문 : J. Appl. Phys., vol. 94, no. 2, 15 Jul 2003.  Paulson, Birkmire and Shafarman
%
% c0=3e8;
% hbar=6.582e-16;
% 
% e_=fliplr([(0.75:0.05:1.95) (2.00:0.1:4.60)]).';
% w_=1/hbar*e_;
% l_=2*pi*c0./w_;
% ln_=l_*1e9;
% 

function result=CIGS_nk(lambda);

lambda=lambda*10^9;



CIGS_data=[ 269.7     2.73    1.33;
          275.7     2.72    1.24;
          282.0     2.70    1.17;
          288.5     2.67    1.12;
          295.4     2.63    1.09;
          302.6     2.61    1.08;
          310.2     2.59    1.08;
          318.1     2.59    1.09;
          326.5     2.61    1.10;
          335.3     2.64    1.08;
          344.6     2.65    1.05;
          354.5     2.64    1.04;
          364.9     2.63    1.05;
          376.0     2.65    1.10;
          387.7     2.70    1.13;
          400.2     2.79    1.16;
          413.6     2.92    1.14;
          427.8     3.05    1.04;
          443.1     3.10    0.91;
          459.5     3.10    0.79;
          477.2     3.07    0.71;
          496.3     3.05    0.64;
          516.9     3.03    0.59;
          539.4     3.01    0.55;
          563.9     2.99    0.52;
          590.8     2.98    0.49;
          620.3     2.97    0.47;
          636.2     2.97    0.45;
          653.0     2.97    0.44;
          670.6     2.96    0.43;
          689.3     2.97    0.42;
          709.0     2.97    0.40;
          729.8     2.97    0.39;
          751.9     2.97    0.38;
          775.4     2.98    0.37;
          800.4     2.98    0.36;
          827.1     3.00    0.34;
          855.6     3.01    0.32;
          886.2     3.02    0.28;
          919.0     3.01    0.26;
          954.4     3.02    0.24;
          992.5     3.03    0.21;
          1033.9    3.05    0.15;
          1078.9    3.01    0.08;
          1127.9    2.96    0.06;
          1181.6    2.92    0.05;
          1240.7    2.90    0.05;
          1306.0    2.88    0.05;
          1378.5    2.86    0.04;
          1459.6    2.85    0.04;
          1550.8    2.84    0.04;
          1654.2    2.83    0.03];
        

this_data = CIGS_data ;

if min(lambda) < this_data(1,1) || max(lambda) > this_data(end,1)
    warning(['Out of valid range (' num2str(this_data(1,1)) ' ~ ' num2str(this_data(end,1)) ' nm)']);
end

in_range = (this_data(1,1) <= lambda).*(lambda <= this_data(end,1)) ;
n = in_range.*(interp1(this_data(:,1), this_data(:,2), lambda, 'spline'))+(1-in_range).*(interp1(this_data(:,1), this_data(:,2), lambda, 'linear')) ;
k = in_range.*(interp1(this_data(:,1), this_data(:,3), lambda, 'spline'))+(1-in_range).*(interp1(this_data(:,1), this_data(:,3), lambda, 'linear')) ;

result=n+j*k;